sebanc/brunch/external-drivers/rtl8723du/core/rtw_efuse.c
// SPDX-License-Identifier: GPL-2.0
/* Copyright(c) 2007 - 2017 Realtek Corporation */

#define _RTW_EFUSE_C_

#include <drv_types.h>
#include <hal_data.h>

#include "../hal/HalEfuseMask8723D_USB.h"

/*------------------------Define local variable------------------------------*/
u8 fakeEfuseBank = {0};
u32 fakeEfuseUsedBytes = {0};
u8 fakeEfuseContent[EFUSE_MAX_HW_SIZE] = {0};
u8 fakeEfuseInitMap[EFUSE_MAX_MAP_LEN] = {0};
u8 fakeEfuseModifiedMap[EFUSE_MAX_MAP_LEN] = {0};

u32 BTEfuseUsedBytes = {0};
u8 BTEfuseContent[EFUSE_MAX_BT_BANK][EFUSE_MAX_HW_SIZE];
u8 BTEfuseInitMap[EFUSE_BT_MAX_MAP_LEN] = {0};
u8 BTEfuseModifiedMap[EFUSE_BT_MAX_MAP_LEN] = {0};

u32 fakeBTEfuseUsedBytes = {0};
u8 fakeBTEfuseContent[EFUSE_MAX_BT_BANK][EFUSE_MAX_HW_SIZE];
u8 fakeBTEfuseInitMap[EFUSE_BT_MAX_MAP_LEN] = {0};
u8 fakeBTEfuseModifiedMap[EFUSE_BT_MAX_MAP_LEN] = {0};

u8 maskfileBuffer[64];
/*------------------------Define local variable------------------------------*/
static bool rtw_file_efuse_IsMasked(struct adapter * pAdapter, u16 Offset)
{
	int r = Offset / 16;
	int c = (Offset % 16) / 2;
	int result = 0;

	if (pAdapter->registrypriv.boffefusemask)
		return false;

	if (c < 4) /* Upper double word */
		result = (maskfileBuffer[r] & (0x10 << c));
	else
		result = (maskfileBuffer[r] & (0x01 << (c - 4)));

	return (result > 0) ? 0 : 1;
}

static bool efuse_IsMasked(struct adapter *pAdapter, u16 Offset)
{
	if (pAdapter->registrypriv.boffefusemask)
		return false;

	return (IS_MASKED(8723D, _MUSB, Offset)) ? true : false;
}

void rtw_efuse_mask_array(struct adapter * pAdapter, u8 *pArray)
{
}

u16 rtw_get_efuse_mask_arraylen(struct adapter * pAdapter)
{
	return 0;
}

static void rtw_mask_map_read(struct adapter * adapt, u16 addr, u16 cnts,
			      u8 *data)
{
	u16 i = 0;

	if (adapt->registrypriv.boffefusemask == 0) {
			for (i = 0; i < cnts; i++) {
				if (adapt->registrypriv.bFileMaskEfuse) {
					/*use file efuse mask.*/
					if (rtw_file_efuse_IsMasked(adapt,
								    addr + i))
						data[i] = 0xff;
				} else {
					if (efuse_IsMasked(adapt, addr + i))
						data[i] = 0xff;
				}
			}
	}
}

u8 rtw_efuse_mask_map_read(struct adapter * adapt, u16 addr, u16 cnts, u8 *data)
{
	u8 ret;
	u16 mapLen;

	EFUSE_GetEfuseDefinition(adapt, EFUSE_WIFI, TYPE_EFUSE_MAP_LEN,
				 (void *)&mapLen, false);
	ret = rtw_efuse_map_read(adapt, addr, cnts , data);

	rtw_mask_map_read(adapt, addr, cnts , data);

	return ret;
}

/* ***********************************************************
 *				Efuse related code
 * *********************************************************** */
static u8 hal_EfuseSwitchToBank(struct adapter *adapt, u8 bank, u8 bPseudoTest)
{
	u8 bRet = false;
	u32 value32 = 0;
#ifdef HAL_EFUSE_MEMORY
	struct hal_com_data * pHalData = GET_HAL_DATA(adapt);
	struct efuse_hal * pEfuseHal = &pHalData->EfuseHal;
#endif

	RTW_INFO("%s: Efuse switch bank to %d\n", __func__, bank);
	if (bPseudoTest) {
#ifdef HAL_EFUSE_MEMORY
		pEfuseHal->fakeEfuseBank = bank;
#else
		fakeEfuseBank = bank;
#endif
		bRet = true;
	} else {
		value32 = rtw_read32(adapt, 0x34);
		bRet = true;
		switch (bank) {
		case 0:
			value32 = (value32 & ~EFUSE_SEL_MASK) |
					      EFUSE_SEL(EFUSE_WIFI_SEL_0);
			break;
		case 1:
			value32 = (value32 & ~EFUSE_SEL_MASK) |
					     EFUSE_SEL(EFUSE_BT_SEL_0);
			break;
		case 2:
			value32 = (value32 & ~EFUSE_SEL_MASK) |
					     EFUSE_SEL(EFUSE_BT_SEL_1);
			break;
		case 3:
			value32 = (value32 & ~EFUSE_SEL_MASK) |
					     EFUSE_SEL(EFUSE_BT_SEL_2);
			break;
		default:
			value32 = (value32 & ~EFUSE_SEL_MASK) |
					     EFUSE_SEL(EFUSE_WIFI_SEL_0);
			bRet = false;
			break;
		}
		rtw_write32(adapt, 0x34, value32);
	}
	return bRet;
}

void rtw_efuse_analyze(struct adapter *	adapt, u8 Type, u8 Fake)
{
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);
	struct efuse_hal *pEfuseHal = &(pHalData->EfuseHal);
	u16 eFuse_Addr = 0;
	u8 offset, wden;
	u16  i, j;
	u8 efuseHeader = 0, efuseExtHdr = 0;
	u8 efuseData[EFUSE_MAX_WORD_UNIT*2] = {0}, dataCnt = 0;
	u16 efuseHeader2Byte = 0;
	u8 *eFuseWord = NULL;
	u8 offset_2_0 = 0;
	u8 pgSectionCnt = 0;
	u8 wd_cnt = 0;
	u8 max_section = 64;
	u16 mapLen = 0, maprawlen = 0;
	bool bExtHeader = false;
	u8 efuseType = EFUSE_WIFI;
	bool bPseudoTest = false;
	u8 bank = 0, startBank = 0, endBank = 1-1;
	bool bCheckNextBank = false;
	u8 protectBytesBank = 0;
	u16 efuse_max = 0;
	u8 ParseEfuseExtHdr, ParseEfuseHeader, ParseOffset, ParseWDEN;
	u8 ParseOffset2_0;

	eFuseWord = rtw_zmalloc(EFUSE_MAX_SECTION_NUM *
				(EFUSE_MAX_WORD_UNIT * 2));
	RTW_INFO("\n");
	if (Type == 0) {
		if (Fake == 0) {
			RTW_INFO("\n\tEFUSE_Analyze Wifi Content\n");
			efuseType = EFUSE_WIFI;
			bPseudoTest = false;
			startBank = 0;
			endBank = 0;
		} else {
			RTW_INFO("\n\tEFUSE_Analyze Wifi Pseudo Content\n");
			efuseType = EFUSE_WIFI;
			bPseudoTest = true;
			startBank = 0;
			endBank = 0;
		}
	} else {
		if (Fake == 0) {
			RTW_INFO("\n\tEFUSE_Analyze BT Content\n");
			efuseType = EFUSE_BT;
			bPseudoTest = false;
			startBank = 1;
			endBank = EFUSE_MAX_BANK - 1;
		} else {
			RTW_INFO("\n\tEFUSE_Analyze BT Pseudo Content\n");
			efuseType = EFUSE_BT;
			bPseudoTest = true;
			startBank = 1;
			endBank = EFUSE_MAX_BANK - 1;
		}
	}

	RTW_INFO("\n\r 1Byte header, [7:4]=offset, [3:0]=word enable\n");
	RTW_INFO("\n\r 2Byte header, header[7:5]=offset[2:0], header[4:0]=0x0F\n");
	RTW_INFO("\n\r 2Byte header, extHeader[7:4]=offset[6:3], extHeader[3:0]=word enable\n");

	EFUSE_GetEfuseDefinition(adapt, efuseType, TYPE_EFUSE_MAP_LEN,
				 (void *)&mapLen, bPseudoTest);
	EFUSE_GetEfuseDefinition(adapt, efuseType, TYPE_EFUSE_MAX_SECTION,
				 (void *)&max_section, bPseudoTest);
	EFUSE_GetEfuseDefinition(adapt, efuseType,
				 TYPE_EFUSE_PROTECT_BYTES_BANK,
				 (void *)&protectBytesBank, bPseudoTest);
	EFUSE_GetEfuseDefinition(adapt, efuseType,
				 TYPE_EFUSE_CONTENT_LEN_BANK,
				 (void *)&efuse_max, bPseudoTest);
	EFUSE_GetEfuseDefinition(adapt, EFUSE_WIFI,
				 TYPE_EFUSE_REAL_CONTENT_LEN,
				 (void *)&maprawlen, false);
	memset(eFuseWord, 0xff, EFUSE_MAX_SECTION_NUM *
	       (EFUSE_MAX_WORD_UNIT * 2));
	memset(pEfuseHal->fakeEfuseInitMap, 0xff, EFUSE_MAX_MAP_LEN);

	for (bank = startBank; bank <= endBank; bank++) {
		if (!hal_EfuseSwitchToBank(adapt, bank, bPseudoTest)) {
			RTW_INFO("EFUSE_SwitchToBank() Fail!!\n");
			return;
		}

		eFuse_Addr = bank * EFUSE_MAX_BANK_SIZE;

