sebanc/brunch/external-drivers/rtl8723du/core/rtw_efuse.c
	return bResult;
}

int Efuse_PgPacketRead(struct adapter *	pAdapter, u8 offset,
		   u8 *data,
		   bool bPseudoTest)
{
	int	ret = 0;

	ret =  pAdapter->hal_func.Efuse_PgPacketRead(pAdapter, offset, data, bPseudoTest);

	return ret;
}

int
Efuse_PgPacketWrite(struct adapter *	pAdapter,
		    u8 offset,
		    u8 word_en,
		    u8 *data,
		    bool bPseudoTest)
{
	int ret;

	ret =  pAdapter->hal_func.Efuse_PgPacketWrite(pAdapter, offset, word_en, data, bPseudoTest);

	return ret;
}


static int
Efuse_PgPacketWrite_BT(struct adapter *	pAdapter,
		       u8 offset,
		       u8 word_en,
		       u8 *data,
		       bool bPseudoTest)
{
	int ret;

	ret =  pAdapter->hal_func.Efuse_PgPacketWrite_BT(pAdapter, offset, word_en, data, bPseudoTest);

	return ret;
}


u8
Efuse_WordEnableDataWrite(struct adapter *	pAdapter,
			  u16 efuse_addr,
			  u8 word_en,
			  u8 *data,
			  bool bPseudoTest)
{
	u8 ret = 0;

	ret =  pAdapter->hal_func.Efuse_WordEnableDataWrite(pAdapter, efuse_addr, word_en, data, bPseudoTest);

	return ret;
}

static u8 efuse_read8(struct adapter * adapt, u16 address, u8 *value)
{
	return efuse_OneByteRead(adapt, address, value, false);
}

static u8 efuse_write8(struct adapter * adapt, u16 address, u8 *value)
{
	return efuse_OneByteWrite(adapt, address, *value, false);
}

/*
 * read/wirte raw efuse data
 */
u8 rtw_efuse_access(struct adapter * adapt, u8 bWrite, u16 start_addr, u16 cnts, u8 *data)
{
	int i = 0;
	u16 real_content_len = 0, max_available_size = 0;
	u8 res = _FAIL ;
	u8(*rw8)(struct adapter *, u16, u8 *);
	u32 backupRegs[4] = {0};


	EFUSE_GetEfuseDefinition(adapt, EFUSE_WIFI, TYPE_EFUSE_REAL_CONTENT_LEN, (void *)&real_content_len, false);
	EFUSE_GetEfuseDefinition(adapt, EFUSE_WIFI, TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, (void *)&max_available_size, false);

	if (start_addr > real_content_len)
		return _FAIL;

	if (bWrite) {
		if ((start_addr + cnts) > max_available_size)
			return _FAIL;
		rw8 = &efuse_write8;
	} else
		rw8 = &efuse_read8;

	efuse_PreUpdateAction(adapt, backupRegs);

	Efuse_PowerSwitch(adapt, bWrite, true);

	/* e-fuse one byte read / write */
	for (i = 0; i < cnts; i++) {
		if (start_addr >= real_content_len) {
			res = _FAIL;
			break;
		}

		res = rw8(adapt, start_addr++, data++);
		if (_FAIL == res)
			break;
	}

	Efuse_PowerSwitch(adapt, bWrite, false);

	efuse_PostUpdateAction(adapt, backupRegs);

	return res;
}
/* ------------------------------------------------------------------------------ */
u16 efuse_GetMaxSize(struct adapter * adapt)
{
	u16 max_size;

	max_size = 0;
	EFUSE_GetEfuseDefinition(adapt, EFUSE_WIFI , TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, (void *)&max_size, false);
	return max_size;
}
/* ------------------------------------------------------------------------------ */
u8 efuse_GetCurrentSize(struct adapter * adapt, u16 *size)
{
	Efuse_PowerSwitch(adapt, false, true);
	*size = Efuse_GetCurrentSize(adapt, EFUSE_WIFI, false);
	Efuse_PowerSwitch(adapt, false, false);

	return _SUCCESS;
}
/* ------------------------------------------------------------------------------ */
u16 efuse_bt_GetMaxSize(struct adapter * adapt)
{
	u16 max_size;

	max_size = 0;
	EFUSE_GetEfuseDefinition(adapt, EFUSE_BT , TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, (void *)&max_size, false);
	return max_size;
}

u8 efuse_bt_GetCurrentSize(struct adapter * adapt, u16 *size)
{
	Efuse_PowerSwitch(adapt, false, true);
	*size = Efuse_GetCurrentSize(adapt, EFUSE_BT, false);
	Efuse_PowerSwitch(adapt, false, false);

	return _SUCCESS;
}

u8 rtw_efuse_map_read(struct adapter * adapt, u16 addr, u16 cnts, u8 *data)
{
	u16 mapLen = 0;

	EFUSE_GetEfuseDefinition(adapt, EFUSE_WIFI, TYPE_EFUSE_MAP_LEN, (void *)&mapLen, false);

	if ((addr + cnts) > mapLen)
		return _FAIL;

	Efuse_PowerSwitch(adapt, false, true);

	efuse_ReadEFuse(adapt, EFUSE_WIFI, addr, cnts, data, false);

	Efuse_PowerSwitch(adapt, false, false);

	return _SUCCESS;
}

u8 rtw_BT_efuse_map_read(struct adapter * adapt, u16 addr, u16 cnts, u8 *data)
{
	u16 mapLen = 0;

	EFUSE_GetEfuseDefinition(adapt, EFUSE_BT, TYPE_EFUSE_MAP_LEN, (void *)&mapLen, false);

	if ((addr + cnts) > mapLen)
		return _FAIL;

	Efuse_PowerSwitch(adapt, false, true);

	efuse_ReadEFuse(adapt, EFUSE_BT, addr, cnts, data, false);

	Efuse_PowerSwitch(adapt, false, false);

	return _SUCCESS;
}

/* ------------------------------------------------------------------------------ */
u8 rtw_efuse_map_write(struct adapter * adapt, u16 addr, u16 cnts, u8 *data)
{
#define RT_ASSERT_RET(expr)												\
	if (!(expr)) {															\
		printk("Assertion failed! %s at ......\n", #expr);							\
		printk("      ......%s,%s, line=%d\n",__FILE__, __func__, __LINE__);	\
		return _FAIL;	\
	}

	u8 *efuse = NULL;
	u8 offset, word_en;
	u8 *map = NULL;
	u8 newdata[PGPKT_DATA_SIZE];
	int	i, j, idx, chk_total_byte;
	u8 ret = _SUCCESS;
	u16 mapLen = 0, startAddr = 0, efuse_max_available_len = 0;
	u32 backupRegs[4] = {0};

	EFUSE_GetEfuseDefinition(adapt, EFUSE_WIFI, TYPE_EFUSE_MAP_LEN, (void *)&mapLen, false);
	EFUSE_GetEfuseDefinition(adapt, EFUSE_WIFI, TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, &efuse_max_available_len, false);

	if ((addr + cnts) > mapLen)
		return _FAIL;

	RT_ASSERT_RET(PGPKT_DATA_SIZE == 8); /* have to be 8 byte alignment */
	RT_ASSERT_RET((mapLen & 0x7) == 0); /* have to be PGPKT_DATA_SIZE alignment for memcpy */

	efuse = rtw_zmalloc(mapLen);
	if (!efuse)
		return _FAIL;

	map = rtw_zmalloc(mapLen);
	if (!map) {
		rtw_mfree(efuse, mapLen);
		return _FAIL;
	}

	memset(map, 0xFF, mapLen);

	ret = rtw_efuse_map_read(adapt, 0, mapLen, map);
	if (ret == _FAIL)
		goto exit;

	memcpy(efuse , map, mapLen);
	memcpy(efuse + addr, data, cnts);

	if (adapt->registrypriv.boffefusemask == 0) {
		for (i = 0; i < cnts; i++) {
			if (adapt->registrypriv.bFileMaskEfuse) {
				if (rtw_file_efuse_IsMasked(adapt, addr + i))	/*use file efuse mask. */
					efuse[addr + i] = map[addr + i];
			} else {
				if (efuse_IsMasked(adapt, addr + i))
					efuse[addr + i] = map[addr + i];
			}
			RTW_INFO("%s , data[%d] = %x, map[addr+i]= %x\n", __func__, addr + i, efuse[ addr + i], map[addr + i]);
		}
	}
	/*Efuse_PowerSwitch(adapt, true, true);*/

